app/Http/Controllers/EmployeeController.php

select * from `branches` where `branches`.`id` in (0, 1)
select * from `departments` where `departments`.`id` in (0, 2, 3)
select * from `designations` where `designations`.`id` in (0, 2)
select * from `employees` where `created_by` = 2
---
    public function index()
    {
        if(\Auth::user()->can('manage employee'))
        {
            if(Auth::user()->type == 'Employee')
            {
                $employees = Employee::where('user_id', '=', Auth::user()->id)->with(['designation','branch','department'])->paginate(9);
            }
            else
            {
                $employees = Employee::where('created_by', \Auth::user()->creatorId())->with(['designation','branch','department'])->paginate(9);

select * from `documents` where `created_by` = 2
select * from `users` where `created_by` = 2
---
    public function create()
    {
        if(\Auth::user()->can('create employee'))
        {
            $company_settings = Utility::settings();
            $documents        = Document::where('created_by', \Auth::user()->creatorId())->get();
            $branches         = Branch::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $departments      = Department::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $designations     = Designation::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $employees        = User::where('created_by', \Auth::user()->creatorId())->get();

select * from `documents` where `created_by` = 2
select * from `employees` where `employees`.`id` = 1 limit 1
---
    public function edit($id)
    {
        $id = Crypt::decrypt($id);
        if(\Auth::user()->can('edit employee'))
        {
            $documents    = Document::where('created_by', \Auth::user()->creatorId())->get();
            $branches     = Branch::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $branches->prepend('Select Branch','');
            $departments  = Department::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $designations = Designation::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $employee     = Employee::find($id);

select * from `employees` where `created_by` = 2 order by `created_at` desc limit 1
---
    function employeeNumber()
    {
        $latest = Employee::where('created_by', '=', \Auth::user()->creatorId())->latest()->first();