app/Http/Controllers/KnowledgeController.php

select * from `knowledge` limit 9 offset 0
select count(*) as aggregate from `knowledge`
---
    public function index()
    {
        //
        $knowledges = Knowledge::paginate(9);

delete from `knowledge` where `id` = 5
select * from `knowledge` limit 9 offset 0
select count(*) as aggregate from `knowledge`
---
    public function destroy(Knowledge $knowledge)
    {
        //
        $knowledge->delete();
        $knowledges = Knowledge::paginate(9);