app/Http/Controllers/TeamController.php

select * from `teams` limit 9 offset 9
select count(*) as aggregate from `teams`
---
    public function index()
    {
        $teams = Team::paginate(9);