app/Http/Controllers/TrainerController.php

select * from `branches` where `branches`.`id` in ('Bins-Hettinger', 'Heller-O\'Conner', 'O\'Hara-Hermann', 'Oberbrunner LLC', 'Thompson Ltd', 'Torphy PLC', 'Waters Ltd', 'Wiegand-Brakus', 'Yost Inc')
select * from `trainers` where `created_by` = 1 limit 9 offset 161190
select count(*) as aggregate from `trainers` where `created_by` = 1
select * from `branches` where `created_by` = 1
---
    public function index()
    {
        $trainers = Trainer::where('created_by', '=', \Auth::user()->creatorId())->with('branches')->paginate(9);

        return view('trainer.index', compact('trainers'));
        if(\Auth::user()->can('manage trainer'))
        {
            $trainers = Trainer::where('created_by', '=', \Auth::user()->creatorId())->with('branches')->get();